Only Generic Annotations may be copied between Legends and other Views
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NonGenericAnnotationsOutsideLegend { get; }
  Visual Basic
Public Shared ReadOnly Property NonGenericAnnotationsOutsideLegend As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NonGenericAnnotationsOutsideLegend {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace